import random
s = [

#['へ', '헤'],
#['む', '무'],
#['に', '니'],
#['ら', '라'],
#['ぬ', '누'],
#['ろ', '로'],
#['ふ', '후'],
#['め', '메'],
#['ほ', '호'],
#['そ', '소'],
#['う', '우'],
#['き', '키']

["アイス","아이스"],
["アビリティ","아비리티이"],
["インベントリ","인반토리"],
["ウィングマン","윈구만"],
["エネルギー","에네르기"],
["オクタン","오쿠탄"],
["カービン","카빈"],
["キルリーダー","키루리다"],
["クレーバー","크레바"],
["ケアパッケージ","케아팟케지"],
["コースティック","코스티잇쿠"],
["サプライボックス","사푸라이봇쿠스"],
["シールド","시루도"],
["スナイパー","스나이파"],
["センチネル","센티네루"],
["ソナー","소나"],
["ターボチャージャー","타보챠자"],
["チャージライフル","챠지라이후루"],
["ツリー","트리"],
["テルミットグレネード","테루밋토구레네도"],
["トラッカー","토랏카"],
["ナックルクラスター","낫쿠루쿠라스타"],
["ニューキャッスル","뉴캿스루"],
["スカルタウン","스카루다운"],
["ネメシス","네메시스"],
["ノックダウン","놋쿠다운"],
["ハボック","하봇쿠"],
["ヒューズ","휴즈"],
["フラットライン","후랏토라인"],
["ヘムロック","하무롯쿠"],
["ホライゾン","호라이존"],
["マスティフ","마스티후"],
["ミラージュ","미라주"],
["ムラデッド","무라뎃도"],
["メディキット","메디킷토"],
["モザンビーク","모잔비쿠"],
["ヤングブラッド","영구부랏도"],
["ユニット","유닛토"],
["ヨウツベ","요우투부"],
["ランページ","란페지"],
["リスポーン","리스폰"],
["ルート","루토"],
["レジェンド","레젠도"],
["ローバ","로바"],
["ワットソン","와토손"],
["ヲタク","오타쿠"],
["バンガロール","반가로루"],
]
'''
["ア","아"],#["イ","이"],
["ウ","우"],#["エ","에"],
["オ","오"],#["カ","카"],
["キ","키"],#["ク","쿠"],
["ケ","케"],#["コ","코"],
["サ","사"],#["シ","시"],
["ス","스"],#["セ","세"],
["ソ","소"],#["タ","타"],
["チ","치"],#["ツ","츠"],
["テ","테"],#["ト","토"],
["ナ","나"],#["ニ","니"],
["ヌ","누"],#["ネ","네"],
["ノ","노"],#["ハ","하"],
["ヒ","히"],#["フ","후"],
["ヘ","헤"],#["ホ","호"],
["マ","마"],#["ミ","미"],
["ム","무"],#["メ","메"],
["モ","모"],#["ヤ","야"],
["ユ","유"],#["ヨ","요"],
["ラ","라"],#["リ","리"],
["ル","루"],#["レ","레"],
["ロ","로"],#["ワ","와"],
["ヲ","오"],#["ン","은"],
'''
sc = [0]*len(s)
while True:
    random.shuffle(s)
    for question in s:
        japanese, korean = question
        user_input = input(f"{japanese}: ")
        if user_input == "exit" :
            for i in range(len(s)):
                s[i].append(sc[i])
            sorted_s = sorted(s, key=lambda x: x[2], reverse=True)
            for i in sorted_s : print(i)
            break
        elif user_input == korean:print("")
        else:
            for i, row in enumerate(s):
                if korean == row[1]:
                    sc[i] += 1
                    break

            print(f"{korean}\n")  







































