
s = """

"""

s = s.split("\n")
for i in s :
  if "ghdwpaksghdwpaksghdwpaks" in i : print(i)


'''

{'kan': '女性', 'sound': 'じょせい', 'mean': '[명사] 1.여성 2.여자 , 3.문법'}
{'kan': '摂取', 'sound': 'せっしゅ', 'mean': '[명사, ス타동사] 1.섭취 2.받아들여 자기 것으로 함'}
{'kan': '大丈夫', 'sound': 'だいじょうぶ', 'mean': '[ダナ] 1.괜찮음, 걱정 없음, 끄떡없음, 문제없음, 틀림없음 2.(부사적으로) 틀림없이, 확실히, 꼭'}
{'kan': '価格', 'sound': 'かかく', 'mean': '[명사] 가격, 값'}
{'kan': '恋愛', 'sound': 'れんあい', 'mean': '[명사, ス자동사] 연애'}
{'kan': '大学生', 'sound': 'だいがくせい', 'mean': '[명사] 대학생, 대학교에 다니는 학생'}
{'kan': '財産', 'sound': 'ざいさん', 'mean': '[명사] 1.재산 2.자산'}
{'kan': '表現', 'sound': 'ひょうげん', 'mean': '[명사, ス타동사] 표현'}
{'kan': '姿勢', 'sound': 'しせい', 'mean': '[명사] 1.자세 2.몸의 모양 3.사물을 대하는 마음가짐, 태도'}
{'kan': '考慮', 'sound': 'こうりょ', 'mean': '[명사, ス타동사] 고려'}
{'kan': '最初', 'sound': 'さいしょ', 'mean': '[명사] 최초, 맨 처음'}
{'kan': '親切', 'sound': 'しんせつ', 'mean': '[명사, ダナ] 친절(함)'}
{'kan': '動画', 'sound': 'どうが', 'mean': '[명사] 1.동화 2.애니메이션'}
{'kan': '事前', 'sound': 'じぜん', 'mean': '[명사] 사전'}
{'kan': '講師', 'sound': 'こうし', 'mean': '[명사] 1.강사 2.(대학 등에서) 강의를 하는 사람'}
{'kan': '想像', 'sound': 'そうぞう', 'mean': '[명사, ス타동사] 상상, 실제로 경험하지 않은 것을 미루어 짐작하는 것, 존재하지 않는 것을 마음에 떠올리는 것'}
{'kan': '分野', 'sound': 'ぶんや', 'mean': '[명사] 1.분야 2.영역 3.활동 범위'}
{'kan': '病気', 'sound': 'びょうき', 'mean': '[명사, ス자동사] 1.병 2.앓음, 질병 3.나쁜 버릇, 악습'}
{'kan': '実感', 'sound': 'じっかん', 'mean': '[명사, ス타동사] 1.실감 2.실물에 접했을 때 받는 느낌 3.실제로 경험한 것과 같은 생생한 느낌'}
{'kan': '悪口', 'sound': 'わるくち', 'mean': '[명사] 욕'}
{'kan': '基準', 'sound': 'きじゅん', 'mean': '[명사] 기준'}
{'kan': '週間', 'sound': 'しゅうかん', 'mean': '[명사] 주간'}
{'kan': '雰囲気', 'sound': 'ふんいき', 'mean': '[명사] 분위기'}
{'kan': '格差', 'sound': 'かくさ', 'mean': '[명사] 격차, 자격·등급·가격'}
{'kan': '無難', 'sound': 'ぶなん', 'mean': '[명사, ダナ] 1.무난(함) 2.흠잡을 만 한 것이 없음, 특별히 좋지도 않지만 나쁘지도 않음 3.무사함, 위험한 일이 없음'}
{'kan': '兵士', 'sound': 'へいし', 'mean': '[명사] 병사, 사병'}
{'kan': '翻訳', 'sound': 'ほんやく', 'mean': '[명사, ス타동사] 번역'}
{'kan': '適応', 'sound': 'てきおう', 'mean': '[명사, ス자동사] 적응'}
{'kan': '無意味', 'sound': 'むいみ', 'mean': '[ダナ] 1.뜻이 없음 2.가치가 없음, 보람이 없음, 헛됨 / [명사] 무의미'}
{'kan': '地域', 'sound': 'ちいき', 'mean': '[명사] 지역'}
{'kan': '電気', 'sound': 'でんき', 'mean': '[명사] 1.전기 2.속어 전등'}
{'kan': '準備', 'sound': 'じゅんび', 'mean': '[명사, ス타동사] 준비'}
{'kan': '相手', 'sound': 'あいて', 'mean': '[명사] 1.상대 2.함께 무엇을 하는 사 람 3.(서로 겨루는) 적수'}
{'kan': '後悔', 'sound': 'こうかい', 'mean': '[명사, ス자동사·타동사] 후회, 뉘우침'}
{'kan': '発音', 'sound': 'はつおん', 'mean': '[명사, ス타동사] 발음'}
{'kan': '写真', 'sound': 'しゃしん', 'mean': "[명사] 1.사진"}
{'kan': '過剰', 'sound': 'かじょう', 'mean': '[명사ノナ] 과잉, 필요한 정도나 수 량보다 많음, 또, 그 상태'}
{'kan': '世界', 'sound': 'せかい', 'mean': '[명사] 1.세계 2.지구상의 모든 나라, 인류 사회 전체 3.어떤 분야나 특정 사회, 또, 그 영역'}
{'kan': '漢字', 'sound': 'かんじ', 'mean': '[명사] 한자'}
{'kan': '日本人', 'sound': 'にほんじん', 'mean': '[명사] 일본인, 일본 사람'}
{'kan': '不安定', 'sound': 'ふあんてい', 'mean': '[명사ノナ] 불안정'}
{'kan': '外見', 'sound': 'がいけん', 'mean': '[명사] 1.외견, 외관, 겉보기 2.남에게 보이는[보여지는] 것'}
{'kan': '無礼', 'sound': 'ぶれい', 'mean': '[명사ノナ] 무례, 실례'}
{'kan': '途中', 'sound': 'とちゅう', 'mean': '[명사] 도중}
{'kan': '説明', 'sound': 'せつめい', 'mean': '[명사, ス타동사] 설명'}
{'kan': '構成', 'sound': 'こうせい', 'mean': '[명사, ス타동사] 구성(물)'}
{'kan': '宿題', 'sound': 'しゅくだい', 'mean': '[명사] 1.숙제 2.학생에게 내 주는 과제 3.앞으로 두고 해결해야 할 문제'}
{'kan': '高校生', 'sound': 'こうこうせい', 'mean': '[명사] 고교생'}
{'kan': '突然', 'sound': 'とつぜん', 'mean': '[부사] 돌연, 갑자기'}
{'kan': '韓国語', 'sound': 'かんこくご', 'mean': '[명사] 한국어'}
{'kan': '関係', 'sound': 'かんけい', 'mean': '[명사, ス자동사] 1.관계 2.서로 관 련이 있음, 또, 그런 관련 3.영향을 미침'}
{'kan': '確実', 'sound': 'かくじつ', 'mean': '[명사, ダナ] 확실(함)'}
{'kan': '家族', 'sound': 'かぞく', 'mean': '[명사] 가족'}
{'kan': '危険', 'sound': 'きけん', 'mean': '[명사, ダナ] 위험'}
{'kan': '手続', 'sound': 'てつづき', 'mean': '[명사] 수속, 절차'}
{'kan': '予定', 'sound': 'よてい', 'mean': '[명사, ス타동사] 예정'}
{'kan': '特異', 'sound': 'とくい', 'mean': '[명사ノナ] 특이'}
{'kan': '政情', 'sound': 'せいじょう', 'mean': '[명사] 정정, 정치 정세, 정계 내 막'}
{'kan': '頑張', 'sound': 'がんばり', 'mean': '[명사] 끝까지 버티는 것, 분발하는 것, 또, 그 힘, 인내력'}
{'kan': '筋肉', 'sound': 'きんにく', 'mean': '[명사] 근육'}
{'kan': '言葉', 'sound': 'ことば', 'mean': '[명사] 1.말 2.(말하는) 말, 이야기 3.언어'}
{'kan': '負担', 'sound': 'ふたん', 'mean': '[명사, ス타동사] 1.부담 2.어떤 일의 의무나 책임을 지는 것'}
{'kan': '勉強', 'sound': 'べんきょう', 'mean': '[명사, ス자동사·타동사] 1.(학업·일 따위에) 열심히 힘을 기울임, 공부 '}
{'kan': '簡単', 'sound': 'かんたん', 'mean': '[명사, ダナ] 1.간단 2.사물이 단순 하여 이해나 취급이 쉬운 것, 또, 그런 모양 3.시간이나 수고가 들지 않는 것, 또, 그런 모양'}
{'kan': '広告', 'sound': 'こうこく', 'mean': '[명사, ス타동사] 광고'}
{'kan': '爽快', 'sound': 'そうかい', 'mean': '[명사, ダナ] 상쾌함, 산뜻하고 기분이 좋은 것'}
{'kan': '報酬', 'sound': 'ほうしゅう', 'mean': '[명사] 보수, 근로의 대가로 주는 돈이나 물품'}
{'kan': '資料', 'sound': 'しりょう', 'mean': '[명사] 자료, 바탕이 되는 재료'}
{'kan': '興味', 'sound': 'きょうみ', 'mean': '[명사] 흥미, 어떤 대상에 대하여 관심을 기울이는 경향'}
{'kan': '短期間', 'sound': 'たんきかん', 'mean': '[명사] 단기간'}
{'kan': '今日', 'sound': 'きょう', 'mean': '[명사] 1.오늘 2.금일 3.같은 날짜[요 일]의 날'}
{'kan': '小学生', 'sound': 'しょうがくせい', 'mean': '[명사] 소학생, 초등학교 학생'}
{'kan': '一週間', 'sound': 'いっしゅうかん', 'mean': '[명사] 한 주간, 일주일간, 7일간'}
{'kan': '時点', 'sound': 'じてん', 'mean': '[명사] 시점'}
{'kan': '孤独', 'sound': 'こどく', 'mean': '[명사ナノ] 1.고독 2.(친구·친척이 없 이) 외톨이인 것'}
{'kan': '実家', 'sound': 'じっか', 'mean': '[명사] 1.실가 2.생가, 자신이 태어난 집, 부모의 집 3.친정, 양자의 생가'}
{'kan': '小説家', 'sound': 'しょうせつか', 'mean': '[명사] 소설가'}
{'kan': '自炊', 'sound': 'じすい', 'mean': '[명사, ス자동사] 1.자취, 손수 식사를 준비하는 것 2.종이 서적을 디지털화하는 것'}
{'kan': '出会', 'sound': 'しゅっかい', 'mean': '[명사, ス자동사] 만남, 마주침, 해후'}
{'kan': '小説', 'sound': 'しょうせつ', 'mean': '[명사] 소설'}
{'kan': '保持', 'sound': 'ほじ', 'mean': '[명사, ス타동사] 보유, 계속 유지함'}
{'kan': '必要', 'sound': 'ひつよう', 'mean': '[명사ノナ] 필요(함)'}
{'kan': '自制', 'sound': 'じせい', 'mean': '[명사, ス타동사] 자제, 자기 억제'}
{'kan': '方向', 'sound': 'ほうこう', 'mean': '[명사] 1.방향 2.방침'}
{'kan': '敬語', 'sound': 'けいご', 'mean': '[명사] 경어, 높임말'}
{'kan': '問題', 'sound': 'もんだい', 'mean': '[명사] 문제'}
{'kan': '普通', 'sound': 'ふつう', 'mean': '[부사] 보통, 대개, 일반적으로'}
{'kan': '背景', 'sound': 'はいけい', 'mean': '[명사] 배경'}
{'kan': '鶏肉', 'sound': 'けいにく', 'mean': '[명사] 계육, 닭고기'}
{'kan': '一生懸命', 'sound': 'いっしょうけんめい', 'mean': '[명사, ダナ] 목숨 걸고 일을 함, 매우 열심히 함'}
{'kan': '突然', 'sound': 'とつぜん', 'mean': '[부사] 돌연, 갑자기'}
{'kan': '副作用', 'sound': 'ふくさよう', 'mean': '[명사] 부작용'}
{'kan': '充電', 'sound': 'じゅうでん', 'mean': '[명사, ス자동사·타동사] 충전'}
{'kan': '意味', 'sound': 'いみ', 'mean': '[명사, ス타동사] 1.의미, 뜻 2.말의 뜻 3.(표현이나 행동의) 의도, 까닭'}
{'kan': '金曜日', 'sound': 'きんようび', 'mean': '[조수사] 금요일'}
{'kan': '解決', 'sound': 'かいけつ', 'mean': '[명사, ス자동사·타동사] 해결'}
{'kan': '会話', 'sound': 'かいわ', 'mean': '[명사, ス자동사] 회화, 만나서 이야 기를 나누는 것, 또, 그 이야기'}
{'kan': '快適', 'sound': 'かいてき', 'mean': '[명사, ダナ] 쾌적(함)'}
{'kan': '失礼', 'sound': 'しつれい', 'mean': '[명사ノナ, ス자동사] 1.실례 2.예의가 없음, 무례(함)]'}
{'kan': '疑問', 'sound': 'ぎもん', 'mean': '[명사] 의문'}
{'kan': '約束', 'sound': 'やくそく', 'mean': '[명사, ス타동사] 1.약속 2.언약 3.(사회 일반의) 규칙, 규정'}
{'kan': '希望', 'sound': 'きぼう', 'mean': '[명사, ス타동사] 희망'}
{'kan': '理解', 'sound': 'りかい', 'mean': '[명사, ス타동사] 1.이해 2.사리를 분 별하여 해석함, 깨달아 앎 3.남의 입장이나 기분을 잘 헤아림'}
{'kan': '全文', 'sound': 'ぜんぶん', 'mean': '[명사] 전문'}
{'kan': '就寝', 'sound': 'しゅうしん', 'mean': '[명사, ス자동사] 취침'}
{'kan': '現実', 'sound': 'げんじつ', 'mean': '[명사] 현실'}
{'kan': '本当', 'sound': 'ほんとう', 'mean': "[명사] 1.진실, 정말, 진짜, 사실, 진정함 2.정상임, 제대로임 3.정말이지, 실로, 참으로"}
{'kan': '苦労', 'sound': 'くろう', 'mean': '[명사ノナ, ス자동사] 1.노고, 고생, 애씀 2.(‘ご苦労’의 꼴로) 남에게 폐를 끼치는 것'}
{'kan': '混乱', 'sound': 'こんらん', 'mean': '[명사, ス자동사] 혼란'}
{'kan': '日常的', 'sound': 'にちじょうてき', 'mean': '[ダナ] 일상적'}
{'kan': '実際', 'sound': 'じっさい', 'mean': '[명사] 1.실제 2.있는 그대로의 모습, 본모습, 실태 / [부사] / [정말로, 참으로.]'}
{'kan': '部分', 'sound': 'ぶぶん', 'mean': '[명사] 부분, 전체를 여러 개로 나눈 것 중의 하나'}
{'kan': '留学', 'sound': 'りゅうがく', 'mean': '[명사, ス자동사] 유학'}
{'kan': '手首', 'sound': 'てくび', 'mean': '[명사] 손목'}
{'kan': '内容', 'sound': 'ないよう', 'mean': '[명사] 1.내용 2.내용물, 알맹이'}
{'kan': '結論', 'sound': 'けつろん', 'mean': '[명사, ス자동사] 1.결론 2.최종적으로 판단을 내림'}
{'kan': '素敵', 'sound': 'すてき', 'mean': '[ダナ] 썩 뛰어남, 매우 근사함, 아주 멋짐'}
{'kan': '睡眠', 'sound': 'すいみん', 'mean': '[명사, ス자동사] 1.수면 2.잠을 자 는 일 3.활동을 쉬는 상태'}
{'kan': '間違', 'sound': 'まちがい', 'mean': '[명사] 1.틀림, 잘못, 오류 2.실수, 과실, 과오 3.싸움, 사고, 말썽'}
{'kan': '気持', 'sound': 'きもち', 'mean': '[명사] 1.마음(가짐), 기분, 감정, 심 정 2.마음의 표현을 겸손하게 이르는 말'}
{'kan': '指摘', 'sound': 'してき', 'mean': '[명사, ス타동사] 지적'}
{'kan': '醤油', 'sound': 'しょうゆ', 'mean': '[명사] 장유, 간장'}
{'kan': '恋人', 'sound': 'こいびと', 'mean': '[명사] 연인, 애인'}
{'kan': '感謝', 'sound': 'かんしゃ', 'mean': '[명사, ス자동사·타동사] 감사, 고맙게 여기는 것, 또, 그 마음'}
{'kan': '偉大', 'sound': 'いだい', 'mean': '[명사ノナ] 위대함, 뛰어나고 훌륭한 모양'}
{'kan': '実力', 'sound': 'じつりょく', 'mean': '[명사] 1.실력 2.실제 갖추고 있는 역량 3.강제력, 무력'}
{'kan': '苦痛', 'sound': 'くつう', 'mean': '[명사] 고통'}
{'kan': '半年', 'sound': 'はんとし', 'mean': '[명사] 반년'}
{'kan': '穀物', 'sound': 'こくもつ', 'mean': '[명사] 곡물, 곡식, 곡류'}
{'kan': '大家族', 'sound': 'だいかぞく', 'mean': '[명사] 대가족'}
{'kan': '混同', 'sound': 'こんどう', 'mean': '[명사, ス타동사·자동사] 혼동'}
{'kan': '練習', 'sound': 'れんしゅう', 'mean': '[명사, ス타동사] 연습'}
{'kan': '所有', 'sound': 'しょゆう', 'mean': '[명사, ス타동사] 소유'}
{'kan': '比較', 'sound': 'ひかく', 'mean': "[명사, ス타동사] 비교"}
{'kan': '健康', 'sound': 'けんこう', 'mean': '[명사, ダナ] 1.건강 2.몸에 탈이 없이 튼튼함 3.건전함'}
{'kan': '直接書', 'sound': 'ちょくせつ', 'mean': '[명사, ダナ, ス자동사] 직접, 사이에 아무것도 끼지 않고 접함, 다른 것을 거치지 않고 곧바로임'}
{'kan': '否定', 'sound': 'ひてい', 'mean': '[명사, ス타동사] 부정'}
{'kan': '単純', 'sound': 'たんじゅん', 'mean': '[명사, ダナ] 1.단순(함) 2.다른 것이 섞여 있지 않음 3.(구조·기능·생각 등이) 복잡하지 않고 간단한 것'}
{'kan': '悲劇', 'sound': 'ひげき', 'mean': '[명사] 비극'}
{'kan': '否定的', 'sound': 'ひていてき', 'mean': '[ダナ] 부정적'}
{'kan': '名門施設', 'sound': 'めいもん', 'mean': '[명사] 명문'}
{'kan': '期間', 'sound': 'きかん', 'mean': '[명사] 기간'}
{'kan': '国外', 'sound': 'こくがい', 'mean': '[명사] 국외, 나라 밖'}
{'kan': '不思議', 'sound': 'ふしぎ', 'mean': '[명사, ダナ] 불가사의, 이상함, 희 한함'}
{'kan': '集中', 'sound': 'しゅうちゅう', 'mean': '[명사, ス자동사·타동사] 집중'}
{'kan': '成長', 'sound': 'せいちょう', 'mean': '[명사, ス자동사] 1.성장 2.(사람 이나 동물이) 자라서 성숙함 3.규모가 커짐, 확대, 발전'}
{'kan': '感情', 'sound': 'かんじょう', 'mean': '[명사] 감정'}
{'kan': '全体', 'sound': 'ぜんたい', 'mean': '[명사] 1.전체 2.전신, 온몸 / [부사] 1.본디, 원래 2.(의문의 뜻을 강조하여) 도대체'}
{'kan': '文化', 'sound': 'ぶんか', 'mean': '[명사] 문화'}
{'kan': '緊張', 'sound': 'きんちょう', 'mean': '[명사, ス자동사] 긴장'}
{'kan': '国旗', 'sound': 'こっき', 'mean': '[명사] 국기'}
{'kan': '正常', 'sound': 'せいじょう', 'mean': '[명사, ダナ] 정상, 제대로인 상태임'}
{'kan': '正直', 'sound': 'しょうじき', 'mean': '[명사, ダナ] 정직(함), 솔직함'}
{'kan': '文章', 'sound': 'ぶんしょう', 'mean': '[명사] 문장, 글월'}
{'kan': '結末', 'sound': 'けつまつ', 'mean': '[명사] 결말'}
{'kan': '過程', 'sound': 'かてい', 'mean': '[명사] 과정, 사물이 변화·진행되어 가는 경로'}
{'kan': '暴力的', 'sound': 'ぼうりょくてき', 'mean': '[ダナ] 폭력적'}
{'kan': '会社', 'sound': 'かいしゃ', 'mean': '[명사] 1.회사 2.공동의 목적을 이루기 위해 조직된 집단'}
{'kan': '仕事', 'sound': 'しごと', 'mean': '[명사] 1.(해야 할) 일, 업무, 행동 2.(생계를 위한) 일, 직업 3.업적, 행동의 결과'}
{'kan': '魅力的', 'sound': 'みりょくてき', 'mean': '[ダナ] 매력적'}
{'kan': '方法', 'sound': 'ほうほう', 'mean': '[명사] 방법'}
{'kan': '見出', 'sound': 'みだし', 'mean': "[명사] 1.표제, 헤드라인 2.(책이나 장부 등의) 목차, 색인, 차례}
{'kan': '最善', 'sound': 'さいぜん', 'mean': '[명사] 1.최선 2.가장 좋은 것 3.할 수 있는 모든 것, 전력'}
{'kan': '出国', 'sound': 'しゅっこく', 'mean': '[명사, ス자동사] 출국'}
{'kan': '一緒', 'sound': 'いっしょ', 'mean': '[명사] 1.함께함, 같이함 3.동반함'}
{'kan': '将来', 'sound': 'しょうらい', 'mean': '[명사] 장래, 미래, 전도'}
{'kan': '清純', 'sound': 'せいじゅん', 'mean': '[명사ノナ] 청순'}
{'kan': '心配', 'sound': 'しんぱい', 'mean': '[명사ノナ] 걱정, 근심, 염려, 심려'}
{'kan': '余裕', 'sound': 'よゆう', 'mean': '[명사] 여유'}
{'kan': '誠意', 'sound': 'せいい', 'mean': '[명사] 성의'}
{'kan': '担当', 'sound': 'たんとう', 'mean': '[명사, ス타동사] 담당'}
{'kan': '覚悟', 'sound': 'かくご', 'mean': '[명사, ス자동사·타동사] 1.각오 2.(앞으로 닥쳐올 일에 대한) 마음의 준비 3.체념하고 마음을 정함'}
{'kan': '残念', 'sound': 'ざんねん', 'mean': '[명사ノナ] 1.분함, 억울함 2.유감스러움, 아쉬움'}
{'kan': '単語', 'sound': 'たんご', 'mean': '[명사] 단어, 낱말'}
{'kan': '批判', 'sound': 'ひはん', 'mean': '[명사, ス타동사] 1.비판 2.사물을 검 토하여 판정·평가하는 것 3.잘못을 지적하여 논하는 것'}
{'kan': '技能', 'sound': 'ぎのう', 'mean': '[명사] 기능'}
{'kan': '最後', 'sound': 'さいご', 'mean': '[명사] 1.최후, 마지막, 맨 뒤'}
{'kan': '大変', 'sound': 'たいへん', 'mean': '[명사] 대사건, 중대사'}
{'kan': '両方', 'sound': 'りょうほう', 'mean': '[명사] 1.양방 2.쌍방, 양자 3.두 방면'}
{'kan': '理性的', 'sound': 'りせいてき', 'mean': '[ダナ] 이성적'}
{'kan': '文化', 'sound': 'ぶんか', 'mean': '[명사] 문화'}
{'kan': '休暇', 'sound': 'きゅうか', 'mean': '[명사] 휴가'}
{'kan': '意訳', 'sound': 'いやく', 'mean': '[명사, ス타동사] 의역'}
{'kan': '人生', 'sound': 'じんせい', 'mean': '[명사] 1.인생 2.사람이 이 세상에 살아감 3.사람이 사는 기간, 일생'}
{'kan': '修正', 'sound': 'しゅうせい', 'mean': '[명사, ス타동사] 수정, 틀리거나 부족한 부분을 바로잡아 고치는 것'}
{'kan': '個人的', 'sound': 'こじんてき', 'mean': '[ダナ] 개인적'}
{'kan': '携帯電話', 'sound': 'けいたいでんわ', 'mean': '[명사] 휴대 전화'}
{'kan': '軍隊', 'sound': 'ぐんたい', 'mean': '[명사] 군대'}
{'kan': '大体', 'sound': 'だいたい', 'mean': '[명사] 1.줄거리, 대강, 개요 2.대다수, 대부분 / [부사] 1.대개, 대충, 거의 2.도대체, 도시, 본시, 본래, 애당초'}
{'kan': '年間', 'sound': 'ねんかん', 'mean': '[명사] 1.연간 2.한 해 동안 3.어떤 연대의 동안'}
{'kan': '依然', 'sound': 'いぜん', 'mean': '[부사, トタル] 의연(히), 여전(히), 전과 다름이 없는 모양'}
{'kan': '連続', 'sound': 'れんぞく', 'mean': '[명사, ス자동사·타동사] 연속, 계속해서 이어지거나 지속하는 것'}
{'kan': '一般', 'sound': 'いっぱん', 'mean': '[명사] 1.일반 2.같음, 매일반임'}
{'kan': '法典', 'sound': 'ほうてん', 'mean': '[명사] 1.법전 2.법률'}
{'kan': '適用', 'sound': 'てきよう', 'mean': '[명사, ス타동사] 적용'}
{'kan': '検査', 'sound': 'けんさ', 'mean': '[명사, ス타동사] 검사'}
{'kan': '努力', 'sound': 'どりょく', 'mean': '[명사, ス자동사] 노력, 애씀'}
{'kan': '宝石同士', 'sound': 'ほうせき', 'mean': '[명사] 보석'}
{'kan': '温室', 'sound': 'おんしつ', 'mean': '[명사] 온실'}
{'kan': '輪廻', 'sound': 'りんね', 'mean': '[명사, ス자동사] 불교 윤회'}
{'kan': '出口', 'sound': 'でぐち', 'mean': '[명사] 출구'}
{'kan': '集団', 'sound': 'しゅうだん', 'mean': '[명사] 집단'}
{'kan': '制止', 'sound': 'せいし', 'mean': '[명사, ス타동사] 제지, 말림'}
{'kan': '演技', 'sound': 'えんぎ', 'mean': '[명사, ス자동사] 1.연기 2.배우가 배 역의 인물이나 성격 등을 표현해 내는 일'}
{'kan': '制裁', 'sound': 'せいさい', 'mean': '[명사, ス타동사] 제재'}
{'kan': '毎日', 'sound': 'まいにち', 'mean': '[명사, 부사] 매일, 날마다'}
{'kan': '発揮', 'sound': 'はっき', 'mean': '[명사, ス타동사] 발휘'}
{'kan': '全部', 'sound': 'ぜんぶ', 'mean': '[명사] 1.(사물의) 전부, 모두, 전체'}
{'kan': '嫉妬', 'sound': 'しっと', 'mean': '[명사, ス타동사] 질투, 시샘'}
{'kan': '経験談', 'sound': 'けいけんだん', 'mean': '[명사] 경험담'}
{'kan': '説教', 'sound': 'せっきょう', 'mean': '[명사, ス자동사] 1.설교 2.(교훈 적인) 잔소리'}
{'kan': '幼児論', 'sound': 'ようじ', 'mean': '[명사] 1.유아 2.어린아이'}
{'kan': '堅固', 'sound': 'けんご', 'mean': '[명사, ダナ] 1.견고 2.건강함, 튼튼함 3.고어 확실함, 의심 없음'}
{'kan': '発想自体', 'sound': 'はっそう', 'mean': '[명사, ス자동사·타동사] 1.발상 2.생각, 생각해 냄 3.떠오른 생각을 효과적으로 표시하는 일'}
{'kan': '年間犯罪', 'sound': 'ねんかん', 'mean': '[명사] 1.연간 2.한 해 동안 3. 어떤 연대의 동안'}
{'kan': '切実', 'sound': 'せつじつ', 'mean': '[ダナノ] 1.절실 2.아주 중요함 3.아주 적절함'}
{'kan': '苦難', 'sound': 'くなん', 'mean': '[명사] 고난'}
{'kan': '自尊心', 'sound': 'じそんしん', 'mean': '[명사] 자존심'}
{'kan': '期待', 'sound': 'きたい', 'mean': '[명사, ス타동사] 기대'}
{'kan': '断絶', 'sound': 'だんぜつ', 'mean': '[명사, ス자동사·타동사] 단절'}
{'kan': '作成', 'sound': 'さくせい', 'mean': '[명사, ス타동사] 작성'}
{'kan': '成績', 'sound': 'せいせき', 'mean': '[명사] 1.성적 2.일이나 사업 등의 결과, 성과, 실적 3.학업 평가나 시험 결과'}
{'kan': '注意', 'sound': 'ちゅうい', 'mean': '[명사, ス자동사] 1.주의 2.유의, 관심을 집중함 3.조심, 경계'}
{'kan': '昨日', 'sound': 'きのう', 'mean': '[명사] 1.어제 2.오늘의 하루 전날 3. 아주 가까운 과거'}
{'kan': '勝手', 'sound': 'かって', 'mean': '[명사, ダナ] 시먹음, 제멋대로 함'}
{'kan': '丈夫', 'sound': 'じょうぶ', 'mean': '[ダナ] 1.건강함, 강건함 2.견고함, 튼튼함, 단단함'}
{'kan': '罪悪感', 'sound': 'ざいあくかん', 'mean': '[명사]죄책감'}
{'kan': '原因', 'sound': 'げんいん', 'mean': '[명사, ス자동사] 원인'}
{'kan': '正常作動', 'sound': 'せいじょう', 'mean': '[명사, ダナ] 정상, 제대로인 상태임'}
{'kan': '座礁', 'sound': 'ざしょう', 'mean': '[명사, ス자동사] 좌초, 배가 암초에 얹힘'}
{'kan': '維持', 'sound': 'いじ', 'mean': '[명사, ス타동사] 유지'}
{'kan': '植物', 'sound': 'しょくぶつ', 'mean': '[명사] 식물'}
{'kan': '直言', 'sound': 'ちょくげん', 'mean': '[명사, ス타동사] 1.직언 2.믿는 바를 거침없이 말함'}
{'kan': '検索', 'sound': 'けんさく', 'mean': '[명사, ス타동사] 검색'}
{'kan': '能力', 'sound': 'のうりょく', 'mean': '[명사] 1.능력 2.특정한 일을 할 수 있는 개인의 역량'}
{'kan': '順調', 'sound': 'じゅんちょう', 'mean': '[명사, ダナ] 순조, 순조로움'}
{'kan': '可愛', 'sound': 'かわいい', 'mean': '[형용사] 1.귀엽다, 예쁘다 2.작다, 조그맣다 3.사랑스럽다, 깊은 애정을 느끼다'}
{'kan': '探検', 'sound': 'たんけん', 'mean': '[명사, ス타동사] 탐험'}
{'kan': '一方的', 'sound': 'いっぽうてき', 'mean': '[ダナ] 일방적'}
{'kan': '直視', 'sound': 'ちょくし', 'mean': '[명사, ス타동사] 직시'}
{'kan': '確率', 'sound': 'かくりつ', 'mean': '[명사] 수학 확률'}
{'kan': '理性', 'sound': 'りせい', 'mean': '[명사] 이성'}
{'kan': '身体的', 'sound': 'しんたいてき', 'mean': '[명사] 신체적'}
{'kan': '精神的', 'sound': 'せいしんてき', 'mean': '[ダナ] 정신적'}
{'kan': '怪我', 'sound': 'けが', 'mean': '[명사, ス자동사·타동사] 1.상처, 부상, 다침 2.잘못, 과실, 손실'}
{'kan': '純粋', 'sound': 'じゅんすい', 'mean': '[명사, ダナ] 1.순수 2.불순물이 없는것'}
{'kan': '最小限', 'sound': 'さいしょうげん', 'mean': '[명사] 최소한'}
{'kan': '落胆', 'sound': 'らくたん', 'mean': '[명사, ス자동사] 낙담'}
{'kan': '心臓', 'sound': 'しんぞう', 'mean': '[명사] 1.심장 2.염통 3.(기계나 조 직의) 중심부, 원동력'}
{'kan': '罪人', 'sound': 'つみびと', 'mean': '[명사] 죄인'}
{'kan': '周辺', 'sound': 'しゅうへん', 'mean': '[명사] 주변'}
{'kan': '制限', 'sound': 'せいげん', 'mean': '[명사, ス타동사] 제한'}
{'kan': '社会性', 'sound': 'しゃかいせい', 'mean': '[명사] 사회성, 사교성'}
{'kan': '別状', 'sound': 'べつじょう', 'mean': '[명사] 다른 상태, 보통과 다른 모양, 이상한 모양'}
{'kan': '質問', 'sound': 'しつもん', 'mean': '[명사, ス자동사·타동사] 질문'}
{'kan': '退社', 'sound': 'たいしゃ', 'mean': '[명사, ス자동사] 1.퇴사 2.퇴직 3. 퇴근'}
{'kan': '挫折感', 'sound': 'ざせつかん', 'mean': '[명사] 좌절감'}
{'kan': '遊泳', 'sound': 'ゆうえい', 'mean': '[명사, ス자동사] 1.유영, 헤엄침 2.처세'}
{'kan': '無気力', 'sound': 'むきりょく', 'mean': '[명사, ダナ] 무기력'}
{'kan': '証明', 'sound': 'しょうめい', 'mean': '[명사, ス타동사] 증명'}
{'kan': '事務', 'sound': 'じむ', 'mean': '[명사] 사무'}
{'kan': '是非', 'sound': 'ぜひ', 'mean': '[명사] 시비, 옳고 그름, 잘잘못'}
{'kan': '本能', 'sound': 'ほんのう', 'mean': '[명사] 본능'}
{'kan': '解決策', 'sound': 'かいけつさく', 'mean': '[명사] 해결책'}
{'kan': '絶望', 'sound': 'ぜつぼう', 'mean': '[명사, ス자동사] 절망'}
{'kan': '未来', 'sound': 'みらい', 'mean': '[명사] 미래'}
{'kan': '中止', 'sound': 'ちゅうし', 'mean': '[명사, ス타동사] 중지'}
{'kan': '病院', 'sound': 'びょういん', 'mean': '[명사] 병원'}
{'kan': '一方', 'sound': 'いっぽう', 'mean': '[명사] 1.일방 2.한 방면, 한 방향 3.한쪽, 한편 ,'}
{'kan': '悪材料', 'sound': 'あくざいりょう', 'mean': '[명사] 1.악재료, 악재 2.악조건'}
{'kan': '事実', 'sound': 'じじつ', 'mean': '[명사] 사실, 실제로 일어난, 또는 있 는 일'}
{'kan': '位置', 'sound': 'いち', 'mean': '[명사, ス자동사] 1.위치 2.사물이 있는 곳, 장소 3.지위, 입장, 자리'}
{'kan': '要素', 'sound': 'ようそ', 'mean': '[명사] 1.요소 2.사물 성립의 근본 조 건 3.그 이상 더 간단하게 나눌 수 없는 성분'}
{'kan': '防止', 'sound': 'ぼうし', 'mean': '[명사, ス타동사] 방지'}
{'kan': '一応', 'sound': 'いちおう', 'mean': '[부사] 1.우선, 어떻든, 일단, 하여 튼 2.한 번, 한 차례'}
{'kan': '感傷', 'sound': 'かんしょう', 'mean': '[명사] 감상, 사물에서 받은 느낌 으로 마음 아파 하는 것, 또, 그런 경향'}
{'kan': '回避', 'sound': 'かいひ', 'mean': '[명사, ス타동사] 회피'}
{'kan': '結局', 'sound': 'けっきょく', 'mean': '[명사] 1.한 판을 다 두는 것 2.결국, 결말, 끝나 게 됨 / [부사] 결국, 일의 마무리에 이르러서.'}
{'kan': '消耗', 'sound': 'しょうもう', 'mean': '[명사, ス자동사·타동사] 1.소모 2.사용하여 줄이 거나 없애는 것'}
{'kan': '自負', 'sound': 'じふ', 'mean': '[명사, ス자동사] 자부, 또, 자부하는 마음'}
{'kan': '短所', 'sound': 'たんしょ', 'mean': '[명사] 단처, 단점, 결점'}
{'kan': '放置', 'sound': 'ほうち', 'mean': '[명사, ス타동사] 방치, 그대로 내버려 두는 것'}
{'kan': '現副審', 'sound': 'ふくしん', 'mean': '[명사] 부심'}
{'kan': '支持', 'sound': 'しじ', 'mean': '[명사, ス타동사] 1.지지 2.지탱하고 버 티는 것 3.어떤 의견‧주장 등에 찬성하고 원조하는 것'}
{'kan': '責任', 'sound': 'せきにん', 'mean': '[명사] 1.책임 2.도맡아 해야 할 임 무, 의무 3.자신이 한 일의 결과에 대한 의무나 부담'}
{'kan': '作業', 'sound': 'さぎょう', 'mean': '[명사, ス자동사] 작업'}
{'kan': '致命的', 'sound': 'ちめいてき', 'mean': '[ダナ] 치명적'}
{'kan': '見落', 'sound': 'みおとし', 'mean': '[명사, ス타동사] 간과, 못보고 넘김[빠뜨림]'}
{'kan': '特定', 'sound': 'とくてい', 'mean': '[명사, ス타동사] 특정, 특별히 지정하는 것'}
{'kan': '巨大', 'sound': 'きょだい', 'mean': '[명사] 거대'}
{'kan': '父親', 'sound': 'ちちおや', 'mean': '[명사] 부친, 아버지'}
{'kan': '心的', 'sound': 'しんてき', 'mean': '[ダナ] 심적'}
{'kan': '権力', 'sound': 'けんりょく', 'mean': '[명사] 권력'}
{'kan': '文 体', 'sound': 'ぶんたい', 'mean': '[명사] 문체'}
{'kan': '悪循環', 'sound': 'あくじゅんかん', 'mean': '[명사, ス자동사] 악순환'}
{'kan': '直後', 'sound': 'ちょくご', 'mean': '[명사] 1.직후 2.바로 뒤'}
{'kan': '無力', 'sound': 'むりょく', 'mean': '[명사ノナ] 무력'}
{'kan': '慰労', 'sound': 'いろう', 'mean': '[명사, ス타동사] 위로'}
{'kan': '是非', 'sound': 'ぜひ', 'mean': '[명사] 시비, 옳고 그름, 잘잘못'}
{'kan': '会社員', 'sound': 'かいしゃいん', 'mean': '[명사] 회사원'}
{'kan': '平和', 'sound': 'へいわ', 'mean': '[명사, ダナ] 평화, 싸움이나 근심 걱 정이 없이 평온 한 모양'}
{'kan': '天国', 'sound': 'てんごく', 'mean': '[명사] 천국, 낙원'}
{'kan': '可能', 'sound': 'かのう', 'mean': '[명사ノナ] 가능'}
{'kan': '自分', 'sound': 'じぶん', 'mean': '[명사] 자기, 자신, 스스로'}
{'kan': '人間', 'sound': 'にんげん', 'mean': '[명사] 1.인간 2.사람 3.사람이 사는 곳, 세상'}
{'kan': '最近解', 'sound': 'さいきん', 'mean': '[명사] 1.최근 2.현재에서 가장 가까운 과거 3.몇 개 중에서 가장 가까움'}
{'kan': '到底挑戦', 'sound': 'とうてい', 'mean': '[부사] 1.도저히, 아무리 하여도 2.결국, 드디어'}
{'kan': '一番', 'sound': 'いちばん', 'mean': '[명사] 1.일 번, 첫째 2.상책, 최상의 방법 / [부사] 1.가장, 제일 2.시험 삼아, 우선, 한번'}
{'kan': '一刻', 'sound': 'いっこく', 'mean': '[명사] 1.일각 2.짧은 시간'}
{'kan': '社会問題', 'sound': 'しゃかいもんだい', 'mean': '[명사] 사회 문제'}
{'kan': '関連', 'sound': 'かんれん', 'mean': '[명사, ス자동사] 관련, 연관'}
{'kan': '論理的', 'sound': 'ろんりてき', 'mean': '[ダナ] 논리적'}
{'kan': '仲間', 'sound': 'なかま', 'mean': '[명사] 1.한패, 동아리, 동료 2.동류, 한 무리 3.근세 에 상공업자의 독점적인 동업 조합'}
{'kan': '普段着', 'sound': 'ふだんぎ', 'mean': '[명사] 평상복'}
{'kan': '扇動', 'sound': 'せんどう', 'mean': '[명사, ス타동사] 선동'}
{'kan': '渇望', 'sound': 'かつぼう', 'mean': '[명사, ス타동사] 갈망, 열망, 소원'}
{'kan': '精髄', 'sound': 'せいずい', 'mean': '[명사] 정수, 진수, 핵심'}
{'kan': '勇気', 'sound': 'ゆうき', 'mean': '[명사] 용기'}
{'kan': '嫉妬心', 'sound': 'しっとしん', 'mean': '[명사] 투기심'}
{'kan': '当該', 'sound': 'とうがい', 'mean': '[연체사] 당해, 해당'}
{'kan': '処断', 'sound': 'しょだん', 'mean': '[명사, ス타동사] 처단'}
{'kan': '気弱', 'sound': 'きよわ', 'mean': '[명사, ダナ] 심약함, 마음이 약한 성질'}
{'kan': '添付', 'sound': 'てんぷ', 'mean': '[명사, ス타동사] 첨부'}
{'kan': '学習', 'sound': 'がくしゅう', 'mean': '[명사, ス타동사] 학습, 배워서 익힘'}
{'kan': '挨拶', 'sound': 'あいさつ', 'mean': '[명사, ス자동사] 1.인사 2.서로 만나거나 헤어질 때 예를 표하는 말이나 행동 '}
{'kan': '懸念', 'sound': 'けねん', 'mean': '[명사, ス타동사] 1.괘념, 걱정, 근심, 불안 2.불교 집념, 집착'}
{'kan': '何度', 'sound': 'なんど', 'mean': '[명사] 1.몇 번, 여러 번'}
{'kan': '人前', 'sound': 'ひとまえ', 'mean': '[명사] 1.남의 앞 2.사람들이 있는[보는] 곳 3.체면'}
{'kan': '照明', 'sound': 'しょうめい', 'mean': '[명사, ス타동사] 조명'}
{'kan': '感嘆', 'sound': 'かんたん', 'mean': '[명사, ス자동사] 감탄'}
{'kan': '以上', 'sound': 'いじょう', 'mean': '[명사] 1.이상 2.(수량이) …보다 많 음, …보다 위임 3.이제까지'}
{'kan': '感情的', 'sound': 'かんじょうてき', 'mean': '[ダナ] 감정적'}
{'kan': '意欲', 'sound': 'いよく', 'mean': '[명사] 의욕'}
{'kan': '名分', 'sound': 'めいぶん', 'mean': '[명사] 1.명분 2.신분·입장에 따라 지켜야 할 본분 3.명목, 표면 상의 이유'}
{'kan': '自由', 'sound': 'じゆう', 'mean': '[명사, ダナ] 자유, 자신의 뜻대로 행 동할 수 있는 것이나 상태'}
{'kan': '状態', 'sound': 'じょうたい', 'mean': '[명사] 상태'}
{'kan': '拡張', 'sound': 'かくちょう', 'mean': '[명사, ス타동사] 확장, 범위·규 모 등을 넓혀 크게 하는 것'}
{'kan': '程度', 'sound': 'ていど', 'mean': '[명사] 1.정도 2.(고저·강약·대소·다소·우열 등의) 분량, 수준'}
{'kan': '門外漢', 'sound': 'もんがいかん', 'mean': '[명사] 문외한'}
{'kan': '宿命', 'sound': 'しゅくめい', 'mean': '[명사] 숙명'}
{'kan': '無神論者', 'sound': 'むしんろんしゃ', 'mean': '[명사] 무신론자'}
{'kan': '暴走', 'sound': 'ぼうそう', 'mean': '[명사, ス자동사] 1.폭주 2.난폭하게 달림 3. 운전사 없는 차가 내달림'}
{'kan': '飛行機', 'sound': 'ひこうき', 'mean': '[명사] 비행기, 동력으로 프로펠러를 돌리거나 연 소 가스에 의한 양력을 이용한 항공기'}
{'kan': '適度', 'sound': 'てきど', 'mean': '[ダナノ] 적도, 적당한 정도, 알맞은 정도'}
{'kan': '不自然', 'sound': 'ふしぜん', 'mean': '[명사, ダナノ] 부자연'}
{'kan': '欠点', 'sound': 'けってん', 'mean': '[명사] 1.결점, 단점 2.(학교 성적에서) 낙제점'}
{'kan': '痕跡', 'sound': 'こんせき', 'mean': '[명사] 흔적, 자국'}
{'kan': '資金', 'sound': 'しきん', 'mean': '[명사] 자금'}
{'kan': '自信', 'sound': 'じしん', 'mean': '[명사] 자신(감), 자기의 사고방식∙능 력∙행동 등을 확신하는 것'}
{'kan': '現実的', 'sound': 'げんじつてき', 'mean': '[ダナ] 현실적'}
{'kan': '無条件', 'sound': 'むじょうけん', 'mean': '[명사] 무조건'}
{'kan': '破滅', 'sound': 'はめつ', 'mean': '[명사, ス자동사] 파멸, 멸망'}
{'kan': '立場', 'sound': 'たちば', 'mean': '[명사] 1.설 곳, 발판 2.입장, 처지, 조건, 형편 3.관점, 견지'}
{'kan': '叱咤', 'sound': 'しった', 'mean': '[명사, ス타동사] 질타'}
{'kan': '鋼鉄', 'sound': 'こうてつ', 'mean': '[명사] 강철'}
{'kan': '露出', 'sound': 'ろしゅつ', 'mean': '[명사, ス자동사·타동사] 1.노출 2.밖으로 드러남[드러냄]'}
{'kan': '課題', 'sound': 'かだい', 'mean': '[명사] 1.과제 2.주어진 주제[제목], 풀어야 할 문제 3.해결해야 할 문제, 주어진 임무'}
{'kan': '錯覚', 'sound': 'さっかく', 'mean': '[명사, ス자동사] 착각'}
{'kan': '熱心', 'sound': 'ねっしん', 'mean': '[명사, ダナ] 열심(임),열성[열정]을 쏟아붓는 것, 또, 그 모양'}
{'kan': '無我', 'sound': 'むが', 'mean': '[명사] 무아, 무의식'}
{'kan': '普段', 'sound': 'ふだん', 'mean': '[명사, 부사] 항상, 평상시, 평소'}
{'kan': '天才', 'sound': 'てんさい', 'mean': '[명사] 천재, 선천적으로 갖추고 있 는 뛰어난 재능, 또, 그런 재능을 가진 사람'}
{'kan': '直前', 'sound': 'ちょくぜん', 'mean': '[명사] 1.직전 2.바로 앞'}
{'kan': '精製', 'sound': 'せいせい', 'mean': '[명사, ス타동사] 정제'}
{'kan': '該当', 'sound': 'がいとう', 'mean': '[명사, ス자동사] 해당, 들어맞음[적합함]'}
{'kan': '一言', 'sound': 'ひとこと', 'mean': '[명사] 일언, 한마디 말, 간단한 말'}
{'kan': '身近', 'sound': 'みぢか', 'mean': '[ダナノ] 1.자기 몸에 가까운 곳, 신변 2.자신과 깊은 관계에 있는 것, 일상 있어 친숙한 모양'}
{'kan': '話題', 'sound': 'わだい', 'mean': '[명사] 화제'}
{'kan': '信頼', 'sound': 'しんらい', 'mean': '[명사, ス타동사] 신뢰, 믿고 의지함'}
{'kan': '大切', 'sound': 'たいせつ', 'mean': '[ダナ] 1.중요함, 귀중함, 소중함 2.소중히 여겨 조 심히 다루는 모양'}
{'kan': '作品', 'sound': 'さくひん', 'mean': '[명사] 작품'}
{'kan': '意見', 'sound': 'いけん', 'mean': '[명사, ス자동사] 1.의견, 어떤 대상에 대하여 가지는 주장·생각 2.훈계함, 타이름'}
{'kan': '賢明', 'sound': 'けんめい', 'mean': '[명사, ダナ] 현명, 어질고 사리에 밝음'}
{'kan': '苦衷', 'sound': 'くちゅう', 'mean': '[명사] 고충'}
{'kan': '破壊', 'sound': 'はかい', 'mean': '[명사, ス자동사·타동사] 파괴'}
{'kan': '学生', 'sound': 'がくせい', 'mean': '[명사] 학생, 특히, 대학생'}
{'kan': '就職', 'sound': 'しゅうしょく', 'mean': '[명사, ス자동사] 취직'}
{'kan': '徹底的', 'sound': 'てっていてき', 'mean': '[ダナ] 철저함'}
{'kan': '自己', 'sound': 'じこ', 'mean': '[명사] 1.자기 2.그 사람 자신 3.자아'}
{'kan': '没頭', 'sound': 'ぼっとう', 'mean': '[명사, ス자동사] 몰두, 한 가지 일 에만 열중함[집중함]'}
{'kan': '使命', 'sound': 'しめい', 'mean': '[명사] 사명'}
{'kan': '自責', 'sound': 'じせき', 'mean': '[명사, ス자동사] 자책'}
{'kan': '結果的', 'sound': 'けっかてき', 'mean': '[ダナ] 결과적'}
{'kan': '今後', 'sound': 'こんご', 'mean': '[명사] 금후, 차후, 이후'}
{'kan': '年齢', 'sound': 'ねんれい', 'mean': '[명사] 연령, 나이'}
{'kan': '不細工', 'sound': 'ぶさいく', 'mean': '[명사, ダナ] 1.만듦새[솜씨]가 서투르고 모양이 없음 2.못생김'}
{'kan': '原初的', 'sound': 'げんしょてき', 'mean': '[명사] 원초적'}
{'kan': '合理', 'sound': 'ごうり', 'mean': '[명사] 합리'}
{'kan': '発生', 'sound': 'はっせい', 'mean': '[명사, ス자동사·타동사] 1.발생 2. 일이나 사물이 생겨나는 것'}
{'kan': '瞬間', 'sound': 'しゅんかん', 'mean': '[명사] 순간, 아주 짧은 시간'}
{'kan': '一度', 'sound': 'いちど', 'mean': '[명사] 1.한 번, 일 회, 한 차례 2.(부사적으로) 어떤 일을 시험 삼아 시도하는 모양: 한번, 일단'}
{'kan': '下敷', 'sound': 'したじき', 'mean': '[명사] 1.물건 밑에 까는 것, 깔개, 받침, 책받침 2.본보기, 바탕, 모범, 표준'}
{'kan': '歓迎', 'sound': 'かんげい', 'mean': '[명사, ス타동사] 환영'}
{'kan': '一部', 'sound': 'いちぶ', 'mean': '[명사] 1.일부 2.일부분'}
{'kan': '距離', 'sound': 'きょり', 'mean': '[명사] 거리, 간격'}
{'kan': '滑稽', 'sound': 'こっけい', 'mean': '[명사, ダナ] 1.우스움 2.골계, 해학, 익살맞음 3.우스꽝스러움'}
{'kan': '完璧', 'sound': 'かんぺき', 'mean': '[명사, ダナ] 완벽'}
{'kan': '安心', 'sound': 'あんしん', 'mean': '[명사ノナ, ス자동사] 안심'}
{'kan': '要因', 'sound': 'よういん', 'mean': '[명사] 요인'}
{'kan': '過小評価', 'sound': 'かしょうひょうか', 'mean': '[명사, ス타동사] 과소 평가'}
{'kan': '前向', 'sound': 'まえむき', 'mean': '[명사, ダナ] 1.정면으로 향함, 앞쪽을 향함 2.사고 방식이 발전적[건설적]·적극적·긍정적임'}
{'kan': '反論', 'sound': 'はんろん', 'mean': '[명사, ス자동사·타동사] 반론, 논박'}
{'kan': '記録', 'sound': 'きろく', 'mean': '[명사, ス타동사] 1.기록 2.후일에 남 길 목적으로 사 실을 적는 것, 또, 그 글 '}
{'kan': '根源', 'sound': 'こんげん', 'mean': '[명사] 근원, 근본'}
{'kan': '不可能', 'sound': 'ふかのう', 'mean': '[명사ノナ] 불가능'}
{'kan': '使用', 'sound': 'しよう', 'mean': '[명사, ス타동사] 사용'}
{'kan': '今回', 'sound': 'こんかい', 'mean': '[명사] 금번, 이번'}
{'kan': '同様', 'sound': 'どうよう', 'mean': '[명사, ダナノ] 같음, 같은 모양, 마찬가지임'}
{'kan': '制作', 'sound': 'せいさく', 'mean': '[명사, ス타동사] 제작, 예술 작품· 방송 프로그램 따위를 만듦, 또, 그 작품'}
{'kan': '真昼', 'sound': 'まひる', 'mean': '[명사] 한낮, 대낮, 백주'}
{'kan': '投影', 'sound': 'とうえい', 'mean': '[명사, ス타동사] 1.투영 2.사물의 비친 그림자, 반영'}
{'kan': '絶対', 'sound': 'ぜったい', 'mean': '[명사] 1.절대 2.비교·대립의 대상이 없는 것 / [부사] 1.무조건, 무슨 일이 있어도 2.결코'}
{'kan': '原罪', 'sound': 'げんざい', 'mean': '[명사] 종교 원죄'}
{'kan': '子供', 'sound': 'こども', 'mean': '[명사] 1.아이, 어린아이 2.자식, 아들딸 3.생각이 모 자람, 또, 그러한 사람'}
{'kan': '被害', 'sound': 'ひがい', 'mean': '[명사] 피해'}
{'kan': '当時', 'sound': 'とうじ', 'mean': '[명사] 1.당시 2.그 무렵, 그때 3.[노 인어] 현금, 현 재, 요즈음'}
{'kan': '緩和', 'sound': 'かんわ', 'mean': '[명사, ス자동사·타동사] 완화'}
{'kan': '警察官', 'sound': 'けいさつかん', 'mean': '[명사] 경찰관'}
{'kan': '永遠', 'sound': 'えいえん', 'mean': '[명사, ダナ] 영원(함)'}
{'kan': '人間関係', 'sound': 'にんげんかんけい', 'mean': '[명사] 인간관계'}
{'kan': '可能性', 'sound': 'かのうせい', 'mean': '[명사] 1.가능성 2.실현될 전망 3.잠재적인 발전성'}
{'kan': '反対', 'sound': 'はんたい', 'mean': '[명사, ダナ] 어떤 사물과의 대립 관계에 있음'}
{'kan': '散在', 'sound': 'さんざい', 'mean': '[명사, ス자동사] 산재'}
{'kan': '何事', 'sound': 'なにごと', 'mean': '[명사] 1.어떤 일, 무슨 일 2.모든 일, 만사'}
{'kan': '合理的', 'sound': 'ごうりてき', 'mean': '[ダナ] 합리적'}
{'kan': '一人前', 'sound': 'いちにんまえ', 'mean': '[명사] 1.일인분, 한 사람 몫 2.어른'}
{'kan': '事故', 'sound': 'じこ', 'mean': '[명사] 사고'}
{'kan': '評価', 'sound': 'ひょうか', 'mean': '[명사, ス타동사] 1.평가 2.가치·값 을 매김 3.가치 를 인정함'}
{'kan': '理想的', 'sound': 'りそうてき', 'mean': '[ダナ] 이상적'}
{'kan': '保護者', 'sound': 'ほごしゃ', 'mean': '[명사] 보호자'}
{'kan': '欠席記録', 'sound': 'けっせき', 'mean': '[명사, ス자동사·타동사] 결석, 나가야 할 자리에 나가지 않음'}
{'kan': '発展', 'sound': 'はってん', 'mean': '[명사, ス자동사] 1.발전 2.세력이 성대해짐 3.높은 단계로 나아감'}
{'kan': '分身', 'sound': 'ぶんしん', 'mean': '[명사] 분신'}
{'kan': '元気', 'sound': 'げんき', 'mean': '[명사, ダナ] 원기, 기력, 건강한 모양'}
{'kan': '利己的', 'sound': 'りこてき', 'mean': '[ダナ] 이기적'}
{'kan': '美学', 'sound': 'びがく', 'mean': '[명사] 미학'}
{'kan': '番組', 'sound': 'ばんぐみ', 'mean': '[명사] 방송(프로그램), 편성이나 순서, 또 그것을 쓴 것'}
{'kan': '点数', 'sound': 'てんすう', 'mean': '[명사] 1.점수 2.득점수 3.물건의 수'}
{'kan': '病身', 'sound': 'びょうしん', 'mean': '[명사] 병든 몸'}
{'kan': '機会', 'sound': 'きかい', 'mean': '[명사] 기회, 가장 좋은 시기나 때'}
{'kan': '欲張', 'sound': 'よくばり', 'mean': '[명사ノナ] 욕심이 많음'}
{'kan': '無責任', 'sound': 'むせきにん', 'mean': '[명사, ダナノ] 1.무책임 2.책임 없음 3.책임 관념이 없음'}
{'kan': '自覚', 'sound': 'じかく', 'mean': '[명사, ス자동사·타동사] 1.자각 2.분명히 아는 것'}
{'kan': '重荷', 'sound': 'おもに', 'mean': '[명사] 1.무거운 짐 2.무게가 나가는 짐 3.과중한 부 담·책임, 괴로운 일, 짐스러운 일'}
{'kan': '確信', 'sound': 'かくしん', 'mean': '[명사, ス타동사] 확신'}
{'kan': '数字', 'sound': 'すうじ', 'mean': '[명사] 1.숫자, 수치 2.수를 나타내는 글자'}
{'kan': '修理', 'sound': 'しゅうり', 'mean': '[명사, ス타동사] 수리, 수선, 부서 지거나 고장 난 부분을 손보아 고치는 것'}
{'kan': '説得', 'sound': 'せっとく', 'mean': '[명사, ス타동사] 설득, 상대가 납득하도록 깨우쳐 말하는 것'}
{'kan': '嫌悪', 'sound': 'けんお', 'mean': '[명사, ス타동사] 혐오, 미워하고 싫어함'}
{'kan': '読者', 'sound': 'どくしゃ', 'mean': '[명사] 독자'}
{'kan': '意思', 'sound': 'いし', 'mean': '[명사] 1.의사 2.무엇을 하고자 하는 근 원이 되는 생각∙의도'}
{'kan': '段階', 'sound': 'だんかい', 'mean': '[명사] 1.단계 2.등급 3.순서'}
{'kan': '部分的', 'sound': 'ぶぶんてき', 'mean': '[ダナ] 부분적'}
{'kan': '見回', 'sound': 'みまわる', 'mean': '[5단활용 자동사] 돌아보다, 돌(아다니)다, 둘러보다'}
{'kan': '平地', 'sound': 'へいち', 'mean': '[명사] 평지'}
{'kan': '表出', 'sound': 'ひょうしゅつ', 'mean': '[명사, ス타동사] 표출, 마음속 의 느낌이나 생 각 따위를 밖에 나타냄'}
{'kan': '価値', 'sound': 'かち', 'mean': '[명사] 1.가치 2.값, 값어치, 유용성 3. 경제 상품이나 재화의 효용'}
{'kan': '充分', 'sound': 'じゅうぶん', 'mean': '[부사, ダナ] 충분함, 십분, 부족 함이 없음'}
{'kan': '開発', 'sound': 'かいはつ', 'mean': '[명사, ス타동사] 1.개발 2.천연자원을 활용하는 것 3.새로운 제품이나 기술을 실용화하는 것'}
{'kan': '決心', 'sound': 'けっしん', 'mean': '[명사, ス자동사·타동사] 결심'}
{'kan': '反応', 'sound': 'はんのう', 'mean': '[명사, ス자동사] 반응'}
{'kan': '本質的', 'sound': 'ほんしつてき', 'mean': '[ダナ] 본질적'}
{'kan': '色彩', 'sound': 'しきさい', 'mean': '[명사] 1.색채 2.빛깔, 색조 3.특색, 성질, 경향'}
{'kan': '面目', 'sound': 'めんぼく', 'mean': '[명사] 면목, 체면, 명예'}
{'kan': '習慣', 'sound': 'しゅうかん', 'mean': '[명사] 1.습관 2.풍습, 관습'}
{'kan': '適当', 'sound': 'てきとう', 'mean': '[ダナノ, ス자동사] 1.적당(함) 2.꼭 들어맞음, 적절함, 적합함, 알맞음 3.(요령을 부리어) 대강대강 함, 적당히 함'}
{'kan': '接近', 'sound': 'せっきん', 'mean': '[명사, ス자동사] 접근'}
{'kan': '屋上', 'sound': 'おくじょう', 'mean': '[명사] 1.옥상 2.지붕의 위'}
{'kan': '万物', 'sound': 'ばんぶつ', 'mean': '[명사] 만물'}
{'kan': '経験', 'sound': 'けいけん', 'mean': '[명사, ス타동사] 경험'}
{'kan': '彼氏', 'sound': 'かれし', 'mean': '[명사] 임, 그이, 애인 또는 남편 되는 사람'}
{'kan': '過去', 'sound': 'かこ', 'mean': '[명사] 1.과거 2.지난날, 옛날 3.(알리고 싶지 않은) 전력'}
{'kan': '副産物', 'sound': 'ふくさんぶつ', 'mean': '[명사] 부산물'}
{'kan': '一抹', 'sound': 'いちまつ', 'mean': '[명사] 일말, 이 살짝 스쳐 간 정도 로) 아주 약간, 한 줄기'}
{'kan': '決意', 'sound': 'けつい', 'mean': '[명사, ス자동사·타동사] 결의, 결심'}
{'kan': '修復', 'sound': 'しゅうふく', 'mean': '[명사, ス타동사] 1.수복 2.복원 3.본래의 좋은 관계로 되돌아감, 회복'}
{'kan': '羅列', 'sound': 'られつ', 'mean': '[명사, ス타동사·자동사] 나열'}
{'kan': '満足', 'sound': 'まんぞく', 'mean': '[명사, ス자동사, ダナ] 1.만족 2.바람이 충족되어 불평불만이 없음 3.완전함, 부족함이 없음'}
{'kan': '過程', 'sound': 'かてい', 'mean': '[명사] 과정'}
{'kan': '納得', 'sound': 'なっとく', 'mean': '[명사, ス타동사] 납득, 이해'}
{'kan': '内面', 'sound': 'ないめん', 'mean': '[명사] 1.내면 2.안쪽, 내부 3.사람 의 정신·심리 (방면)'}
{'kan': '影響', 'sound': 'えいきょう', 'mean': '[명사, ス자동사] 영향, 사물의 효과나 작용이 다 른 것에 미치는 일'}
{'kan': '幸福', 'sound': 'こうふく', 'mean': '[명사, ダナ] 행복(함)'}
{'kan': '悲観的', 'sound': 'ひかんてき', 'mean': '[ダナ] 비관적'}
{'kan': '絵技法', 'sound': 'ぎほう', 'mean': '[명사] 기법'}
{'kan': '論理', 'sound': 'ろんり', 'mean': '[명사] 논리'}
{'kan': '種類', 'sound': 'しゅるい', 'mean': '[명사] 종류'}
{'kan': '最大', 'sound': 'さいだい', 'mean': '[명사] 최대, 가장 큼'}
{'kan': '希薄', 'sound': 'きはく', 'mean': '[명사ノナ] 1.희박 2.(기체·액체의 밀 도·농도가) 묽음, 엷음 3.열의 등이 적음'}
{'kan': '左右', 'sound': 'さゆう', 'mean': '[명사] 1.좌우 2.곁, 측근 / [명사, ス타동사] / [좌우함, 좌지우지함.]'}
{'kan': '比較的', 'sound': 'ひかくてき', 'mean': '[부사] 비교적)'}
{'kan': '供給', 'sound': 'きょうきゅう', 'mean': '[명사, ス타동사] 공급'}
{'kan': '大抵', 'sound': 'たいてい', 'mean': '[부사, ノナ] 1.대개, 대부분, 대강 2.정도껏, 적당 히 3.정말, 아주'}
{'kan': '試験', 'sound': 'しけん', 'mean': '[명사, ス타동사] 1.시험, 테스트'}
{'kan': '焦点', 'sound': 'しょうてん', 'mean': '[명사] 1.초점'}
{'kan': '江南', 'sound': 'こうなん', 'mean': '[명사] 강남'}
{'kan': '反抗', 'sound': 'はんこう', 'mean': '[명사, ス자동사] 반항'}
{'kan': '要求', 'sound': 'ようきゅう', 'mean': '[명사, ス타동사] 요구, 상대에게 강하게 청하는 것'}
{'kan': '活動', 'sound': 'かつどう', 'mean': '[명사, ス자동사] 1.활동'}
{'kan': '百害無益', 'sound': 'ひゃくがいむえき', 'mean': '[명사] 백해무익'}
{'kan': '基本', 'sound': 'きほん', 'mean': '[명사] 기본'}
{'kan': '衝撃的', 'sound': 'しょうげきてき', 'mean': '[ダナ] 충격적'}
{'kan': '教徒', 'sound': 'きょうと', 'mean': '[명사] 교도, 신도'}
{'kan': '経験者', 'sound': 'けいけんしゃ', 'mean': '[명사] 경험자'}
{'kan': '生活', 'sound': 'せいかつ', 'mean': '[명사, ス자동사] 1.생활 2.생물이 존재하고 활동하는 것 3.삶, 사람이 세상에서 살아가는 것'}
{'kan': '当然', 'sound': 'とうぜん', 'mean': '[명사, ダナ] 당연(함)'}
{'kan': '真実', 'sound': 'しんじつ', 'mean': '[명사, ダナノ] 1.진실 2.참, 정말 / [부사] / [참말로, 정말로.]'}
{'kan': '浮気', 'sound': 'うわき', 'mean': '[명사ノナ] 1.변덕, 마음이 들떠 잘 변함 2.바람기'}
{'kan': '統制', 'sound': 'とうせい', 'mean': '[명사, ス타동사] 통제'}
{'kan': '留意', 'sound': 'りゅうい', 'mean': '[명사, ス자동사] 유의'}
{'kan': '苦心', 'sound': 'くしん', 'mean': '[명사, ス자동사] 고심'}
{'kan': '価値判断', 'sound': 'かちはんだん', 'mean': '[명사] 가치 판단'}
{'kan': '完全', 'sound': 'かんぜん', 'mean': '[명사, ダナ] 완전'}
{'kan': '最悪', 'sound': 'さいあく', 'mean': '[명사, ダナ] 최악'}
{'kan': '両手', 'sound': 'りょうて', 'mean': '[명사] 1.양수, 두 손'}
{'kan': '無限', 'sound': 'むげん', 'mean': '[명사, ダナ] 무한'}
{'kan': '総量', 'sound': 'そうりょう', 'mean': '[명사] 총량, 총분량'}
{'kan': '断滅', 'sound': 'だんめつ', 'mean': '[명사, ス자동사·타동사] 단멸, 단절하여 멸망함[시킴]'}
{'kan': '科学', 'sound': 'かがく', 'mean': '[명사] 과학'}
{'kan': '判断', 'sound': 'はんだん', 'mean': '[명사, ス타동사] 1.판단 2.생각해서 확실한 결심을 내림 3.점, 길흉의 판단'}
{'kan': '特別', 'sound': 'とくべつ', 'mean': '[부사, ダナノ] 1.특별(히) 2.별로, 그다지'}
{'kan': '必須', 'sound': 'ひっす', 'mean': '[명사] 필수'}
{'kan': '立派', 'sound': 'りっぱ', 'mean': '[ダナ] 1.훌륭함, 아주 뛰어남 2.당당 함, 정당함, 어 엿함 3.더할 나위 없음, 충분함, 완전함'}
{'kan': '相違点', 'sound': 'そういてん', 'mean': '[명사] 상위점'}
{'kan': '遺棄', 'sound': 'いき', 'mean': '[명사, ス타동사] 유기'}
{'kan': '一日', 'sound': 'いちにち', 'mean': '[명사] 1.일일 2.하루 3.아침부터 저녁까지, 하루 종일'}
{'kan': '映像', 'sound': 'えいぞう', 'mean': '[명사] 1.영상 2.(영화나 TV 등의) 화상 3.머릿속에 떠오르는 사물의 모양, 이미지, 심상'}
{'kan': '本文', 'sound': 'ほんぶん', 'mean': '[명사] 본문'}
{'kan': '大部分', 'sound': 'だいぶぶん', 'mean': '[명사] 대부분, 거의'}
{'kan': '我慢', 'sound': 'がまん', 'mean': '[명사, ス타동사] 1.참음, 견딤, 자제 2.용서함, 봐줌 3.불교 아만, 자기를 훌륭히 생각하고 남을 깔봄'}
{'kan': '偽物', 'sound': 'にせもの', 'mean': '[명사] 가짜 (물건), 위조품'}
{'kan': '付与', 'sound': 'ふよ', 'mean': '[명사, ス타동사] 부여, (내려) 줌'}
{'kan': '砂漠', 'sound': 'さばく', 'mean': '[명사] 사막'}
{'kan': '操縦桿', 'sound': 'そうじゅうかん', 'mean': '[명사] 조종간'}




一方




人誰
国防部
制作者
経験上
私自身
直接読
一生懸命生
比較文化
今日私
今考
書類上
途切
炭水化物
東京
疲労感
?短期間
生活様式
一生懸命運動
突然本当
翻訳機
運営方法
仕事中
発生原因
暗黙的
無脳
一度君
結果物
今私
手伝
今日試験
長続
準備資金
絶対口
一念一
間私
禅仏教
資料準備
全然重要
習慣的
両面性
一度愛
全然足
脱出口
神様
解決方法
第三者的
意味深
姿自体
全部言
今見
皆社会性
軍関連
毎日白
今書
今持
全部聞
全部話
程度胸
型地獄
今振
当文
相手自
今直面
伝達受
美味
余波
一度全部送
一度言
目
毎日一生懸命運動的
一生懸命服用
雰囲気自体
突然罪悪感
素晴
幼少期
自己推測
自己管理
全部受
罪悪感
一番大切
高校
禅仏教的教
全部一応買
気苦労熱心
拒否感
該当慰労文
期待値
先立
時間勉強
全然気
正直現実的
自己信頼向上
毎瞬間証明
程度努力
全部不自然
全部覚
哲学的論弁
一生懸命拭
程度役
程度上
最大限遠
最大限減
千字
江南
'''